// Функция Аккермана — простой пример вычислимой функции, которая не является примитивно рекурсивной.

// Она обозначается A(m,n), принимает два неотрицательных целых числа в качестве параметров и возвращает натуральное число.
// Эта функция растёт очень быстро, например, число A(4,4) настолько велико, что количество цифр в порядке этого числа 
// многократно превосходит количество атомов в наблюдаемой части Вселенной.

// Примеры использования:
// ackermann(0, 0); // 1
// ackermann(2, 1); // 5
// ackermann(2, 3); // 9

//V1
//===============================================================
const functionAkkarman = (m, n) => {
    if(m === 0){
        return n + 1;
    } else if(m > 0 && n === 0){
        return functionAkkarman(m - 1, 1);
    }else if(m > 0 && n > 0){
        return functionAkkarman(m - 1, functionAkkarman(m, n-1));
    };
};
//===============================================================
//V2
//===============================================================
const ackermann = (m, n) => {
  if (m === 0) {
    return n + 1;
  } else if (n === 0 && m > 0) {
    return ackermann(m - 1, 1);
  }

  return ackermann(m - 1, ackermann(m, n - 1));
};
//===============================================================
